In [1]:
import numpy as np
import pandas as pd

In [2]:
students = {
    'name': ['Finley', 'Andrew', 'Blake', "Denis"],
    'last_name': ['Brown', 'Bradley', 'Hughes', "James"],
    'age': [23, 21, 34,24],
    "student_number":[101, 403, 202,1]
    

}

In [3]:
student_df = pd.DataFrame(students)

## Sütun İsimlerini Değiştirmek

### 1. yol:
#Bu yolu daha çok öneriyor.

In [4]:
student_df.head()

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1

In [5]:
student_df.columns

Index(['name', 'last_name', 'age', 'student_number'], dtype='object')

In [6]:
student_df.columns = ['first_name', 'last_name', 'age', 'student_number']

In [7]:
student_df

  first_name last_name  age  student_number
0     Finley     Brown   23             101
1     Andrew   Bradley   21             403
2      Blake    Hughes   34             202
3      Denis     James   24               1

In [25]:
student_df.columns = ['first_name', 'last_name', 'age']

ValueError: Length mismatch: Expected axis has 4 elements, new values have 3 elements

In [8]:
student_df

  first_name last_name  age  student_number
0     Finley     Brown   23             101
1     Andrew   Bradley   21             403
2      Blake    Hughes   34             202
3      Denis     James   24               1

In [9]:
student_df = pd.DataFrame(students)

In [10]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1

In [29]:
student_df.columns = ('first_name', 'last_name', 'age', 'student_number')

In [11]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1

### 2. yol:

In [31]:
student_df

  first_name last_name  age  student_number
0     Finley     Brown   23             101
1     Andrew   Bradley   21             403
2      Blake    Hughes   34             202
3      Denis     James   24               1

In [32]:
"a".capitalize()

'A'

In [33]:
student_df.columns

Index(['first_name', 'last_name', 'age', 'student_number'], dtype='object')

In [34]:
student_df.columns = [e.capitalize() for e in student_df.columns] # ['First_name', 'Last_name', 'Age', 'Student_number']

In [35]:
student_df

  First_name Last_name  Age  Student_number
0     Finley     Brown   23             101
1     Andrew   Bradley   21             403
2      Blake    Hughes   34             202
3      Denis     James   24               1

In [3]:
"a-b-c".replace("-",",")

'a,b,c'

In [37]:
student_df.columns = student_df.columns.str.replace("_","-")

In [38]:
student_df

  First-name Last-name  Age  Student-number
0     Finley     Brown   23             101
1     Andrew   Bradley   21             403
2      Blake    Hughes   34             202
3      Denis     James   24               1

## Spesifik Sütunun Adını Değiştirmek

* Hangi sütun ismi değiştirilecekse, dictionary formatında verip spesifik olarak değiştirebiliriz

In [39]:
student_df = pd.DataFrame(students)

In [40]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1

In [41]:
new_col = {"name":"first", "age":"student_age"}

In [43]:
student_df.rename(columns=new_col) # student_df.rename(columns= {"name":"first", "age":"student_age"})

    first last_name  student_age  student_number
0  Finley     Brown           23             101
1  Andrew   Bradley           21             403
2   Blake    Hughes           34             202
3   Denis     James           24               1

In [44]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1

In [45]:
student_df.rename(columns=new_col, inplace=True) # student_df = student_df.rename(columns=new_col)

In [46]:
student_df

    first last_name  student_age  student_number
0  Finley     Brown           23             101
1  Andrew   Bradley           21             403
2   Blake    Hughes           34             202
3   Denis     James           24               1